import * as yup from "yup"

export const RegistrationSchema = yup.object().shape({
    name: yup
        .string()
        .required("Заполните имя")
        .matches(/^\w+$/, "Неверное имя. Допускаются буквы и цифры")
        .min(3, "Неверное имя. Допускается минимум 3 символа")
        .max(20, "Неверное имя. Допускается максимум 20 символов"),
    login: yup
        .string()
        .required("Заполните логин")
        .matches(/^\w+$/, "Неверный логин. Допускаются буквы и цифры")
        .min(3, "Неверный логин. Допускается минимум 3 символа")
        .max(20, "Неверный логин. Допускается максимум 20 символов"),
    password: yup
        .string()
        .required("Заполните пароль")
        .matches(/^\w+$/, "Неверный пароль. Допускаются буквы и цифры")
        .min(3, "Неверный пароль. Допускается минимум 3 символа")
        .max(20, "Неверный пароль. Допускается максимум 20 символов")
})